InformationRegisters/упПрефиксыШтрихкодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПрефиксыШтрихкодов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДлинаПрефикса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПрефиксыШтрихкодов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура проводит первоначальное заполнение регистра
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	тбзТипыОбъектов = Новый ТаблицаЗначений;
	тбзТипыОбъектов.Колонки.Добавить("ТипОбъекта", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200)));
	тбзТипыОбъектов.Колонки.Добавить("Префикс", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(3)));
	НоваяСтрока = тбзТипыОбъектов.Добавить(); НоваяСтрока.ТипОбъекта = "Документ.упРейс";                         НоваяСтрока.Префикс = "RT";
	НоваяСтрока = тбзТипыОбъектов.Добавить(); НоваяСтрока.ТипОбъекта = "Документ.упЗаявкаНаПеревозкуГруза";       НоваяСтрока.Префикс = "ORD";
	НоваяСтрока = тбзТипыОбъектов.Добавить(); НоваяСтрока.ТипОбъекта = "Документ.упЗаявкаНаТС";                   НоваяСтрока.Префикс = "DO";
	
	НаборЗаписей = РегистрыСведений.упПрефиксыШтрихкодов.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Для каждого Запись Из НаборЗаписей цикл
		СтрокаТаблицы = тбзТипыОбъектов.Найти(Запись.ТипОбъекта, "ТипОбъекта");
		Если СтрокаТаблицы <> Неопределено тогда
			тбзТипыОбъектов.Удалить(СтрокаТаблицы);
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы = тбзТипыОбъектов.Найти(Запись.Префикс, "Префикс");
		Если СтрокаТаблицы <> Неопределено тогда
			тбзТипыОбъектов.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Если тбзТипыОбъектов.Количество() тогда
		Для каждого СтрокаТаблицы Из тбзТипыОбъектов цикл
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.ТипОбъекта = СтрокаТаблицы.ТипОбъекта;
			НоваяСтрока.Префикс    = СтрокаТаблицы.Префикс;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
